{
  "books": [
    {
      "id": 1,
      "title": "Teknik Utama Penyiapan Data untuk Data Scientist Menggunakan R",
      "author": "Bagus Sartono, Aep Hidayatuloh, Dewi Kiswani Bodro, Irawati Tamara",
      "category": "tutorial",
      "price": "Rp 135.000",
      "originalPrice": "Rp 150.000",
      "discount": "10%",
      "image": "images/teknik-utama-penyiapan-data.png",
      "link": "https://ipbpress.com/product/1893-teknik-utama-penyiapan-data-untuk-data-scientist-menggunakan-r",
      "short_description": "Penyiapan data berkontribusi besar dalam memperoleh insight terbaik hasil analisis data. Namun, tidak sedikit tantangan dalam proses penyiapan data ini — mulai dari menangani data yang tidak lengkap, mengatasi data anomali, hingga mengoptimalkan struktur dataset agar siap diproses lebih lanjut.",
      "description": "Penyiapan data berkontribusi besar dalam memperoleh insight terbaik hasil analisis data. Namun, tidak sedikit tantangan dalam proses penyiapan data ini — mulai dari menangani data yang tidak lengkap, mengatasi data anomali, hingga mengoptimalkan struktur dataset agar siap diproses lebih lanjut.<br/><br/>Dengan pendekatan berbasis contoh nyata, dalam buku ini Anda akan belajar:<br/><br/>✅ menggunakan R dan RStudio<br/>✅ memahami strategi penyiapan data<br/>✅ bekerja dengan berbagai format data (CSV, Excel, database)<br/>✅ membersihkan dan menangani missing values, duplikasi, serta data tak konsisten<br/>✅ mentransformasi data secara kreatif<br/>✅ bekerja dengan banyak dataset<br/><br/>Ilustrasi dan penjelasan lengkap dalam buku sangat cocok bagi analis data, data scientist, dan siapa saja yang ingin meningkatkan keterampilan penyiapan data.",
      "isbn": "978-0735211292",
      "pages": 260,
      "publisher": "IPB Press",
      "year": 2025,
      "rating": 4.9,
      "stock": 15,
      "bestseller": false,
      "new": true
    },
    {
      "id": 2,
      "title": "Visualisasi Data yang Efektif",
      "author": "Bagus Sartono, Aep Hidayatuloh",
      "category": "finance",
      "price": "Rp 162.000",
      "originalPrice": "Rp 200.000",
      "discount": "19%",
      "image": "images/visualisasi-data-yang-efektif.png",
      "link": "https://ipbpress.com/product/663-visualisasi-data-yang-efektif",
      "short_description": "Kemampuan menyajikan informasi dan insight hasil analisis data adalah kompetensi penting pada era kini dan masa depan. Teknik visualisasi data yang efektif akan memberikan dampak signifikan pada keberhasilan komunikasi dengan target audiens.",
      "description": "Kemampuan menyajikan informasi dan insight hasil analisis data adalah kompetensi penting pada era kini dan masa depan. Teknik visualisasi data yang efektif akan memberikan dampak signifikan pada keberhasilan komunikasi dengan target audiens. Tidak hanya mempermudah pengenalan pola pada data, visualisasi data juga dapat memperkuat pesan yang ingin disampaikan.<br/><br/>Buku ini membahas berbagai cara visualisasi data yang disesuaikan dengan tujuan dan ketersediaan data, serta memberikan beberapa hal esensial dalam menyiapkan bahan visualisasi data.",
      "isbn": "978-0857197689",
      "pages": 196,
      "publisher": "IPB Press",
      "year": 2021,
      "rating": 4.9,
      "stock": 8,
      "bestseller": true,
      "new": false
    },
    {
      "id": 3,
      "title": "Teknik Eksplorasi Data yang harus dikuasai data scientist",
      "author": "Bagus Sartono, Gerry Alfa D, Dewi Kiswani Bodro",
      "category": "eksplorasi data",
      "price": "Rp 152.000",
      "originalPrice": "Rp 175.000",
      "discount": "13%",
      "image": "images/teknik-eksplorasi-data.png",
      "link": "https://ipbpress.com/product/520-teknik-eksplorasi-data-yang-harus-dikuasai-data-scientist",
      "short_description": "Buku ini disusun untuk memberikan landasan yang cukup bagi para statistisi dan data scientist muda dalam melakukan eksplorasi data sebagai upaya mengenali pola pada data dan berbagai informasi dasar lain yang menarik menggunakan statistik dan plot sederhana.",
      "description": "Buku ini disusun untuk memberikan landasan yang cukup bagi para statistisi dan data scientist muda dalam melakukan eksplorasi data sebagai upaya mengenali pola pada data dan berbagai informasi dasar lain yang menarik menggunakan statistik dan plot sederhana. Pengenalan terhadap pola ini diharapkan mampu menjadi sumber inspirasi sekaligus penunjuk arah dalam melakukan analisis dan pemodelan lebih lanjut, baik itu pemodelan statistika maupun pemodelan machine learning.",
      "isbn": "978-0857197689",
      "pages": 254,
      "publisher": "IPB Press",
      "year": 2020,
      "rating": 4.9,
      "stock": 8,
      "bestseller": false,
      "new": false
    },
    {
      "id": 4,
      "title": "Seleksi Variabel pada Pemodelan Prediktif Statistika dan Machine Learning",
      "author": "Bagus Sartono, Alfian Futuhul Hadi, Evi Ramadhani, Akbar Rizki",
      "category": "machine learning",
      "price": "Rp 110.000",
      "originalPrice": "Rp 155.000",
      "discount": "29%",
      "image": "images/seleksi-variabel.png",
      "link": "https://ipbpress.com/product/1588-seleksi-variabel-pada-pemodelan-prediktif-statistika-dan-machine-learning",
      "short_description": "Sistematika dari buku ini diawali dengan memberikan gambaran umum mengenai proses pemodelan dan seleksi variabel, serta beberapa algoritma pemodelan regresi dan klasifikasi.",
      "description": "Sistematika dari buku ini diawali dengan memberikan gambaran umum mengenai proses pemodelan dan seleksi variabel, serta beberapa algoritma pemodelan regresi dan klasifikasi. Kemudian secara berurutan dibahas berbagai metode seleksi variabel yang terkategori pada pendekatan secara penyaringan (filtering), wrapper, dan embedded. Buku ini ditutup dengan alternatif lain dalam seleksi variabel menggunakan analisis tingkat kepentingan variabel terutama pada pemodelan machine learning.",
      "isbn": "978-0857197689",
      "pages": 174,
      "publisher": "IPB Press",
      "year": 2024,
      "rating": 4.9,
      "stock": 8,
      "bestseller": false,
      "new": false
    },
    {
      "id": 5,
      "title": "Pemodelan Prediktif Berbasis Pohon Klasifikasi",
      "author": "Bagus Sartono, Hendra Dharmawan",
      "category": "machine learning",
      "price": "Rp 145.000",
      "originalPrice": "Rp 175.000",
      "discount": "17%",
      "image": "images/pohon-klasifikasi.png",
      "link": "https://ipbpress.com/product/1016-pemodelan-prediktif-berbasis-pohon-klasifikasi",
      "short_description": "Buku ini disusun untuk membekali para data scientist dan data analyst dengan konsep-konsep dasar pemodelan berbasis pohon, disertai pengembangan lanjutannya.",
      "description": "Buku ini disusun untuk membekali para data scientist dan data analyst dengan konsep-konsep dasar pemodelan berbasis pohon, disertai pengembangan lanjutannya. Beberapa algoritma yang tergolong teknik ensemble seperti random forest dan boosting dibahas secara lengkap sehingga pembaca diharapkan dapat memahami cara kerjanya. Selain itu, buku ini juga dapat menjadi rujukan bagi mahasiswa tingkat sarjana dan magister bidang statistika, sains data, atau informatika yang mengambil mata kuliah terkait pemodelan statistika dan machine learning.",
      "isbn": "978-0857197689",
      "pages": 190,
      "publisher": "IPB Press",
      "year": 2023,
      "rating": 4.9,
      "stock": 8,
      "bestseller": false,
      "new": false
    }
  ],
  "categories": [
    {
      "id": "all",
      "name": "Semua Buku",
      "icon": "📖"
    },
    {
      "id": "bestseller",
      "name": "Best Seller",
      "icon": "🔥"
    },
    {
      "id": "new",
      "name": "Terbaru",
      "icon": "✨"
    },
    {
      "id": "tutorial",
      "name": "Tutorial",
      "icon": "💡"
    },
    {
      "id": "machine learning",
      "name": "Machine Learning",
      "icon": "🤖"
    },
    {
      "id": "finance",
      "name": "Keuangan",
      "icon": "💰"
    },
    {
      "id": "eksplorasi data",
      "name": "Eksplorasi Data",
      "icon": "📊"
    }
  ],
  "store_info": {
    "name": "Galeri Buku Saya",
    "description": "Temukan koleksi buku cetak terbaik dengan kualitas premium dan harga terjangkau",
    "contact": {
      "whatsapp": "+62 812-1022-8688",
      "email": "aephidayatuloh.mail@gmail.com",
      "address": "Jakarta, Indonesia"
    },
    "social_media": {
      "instagram": "@galeribukupremium",
      "facebook": "Galeri Buku Premium",
      "twitter": "@galeribuku"
    },
    "shipping_info": {
      "free_shipping_threshold": "Rp 200.000",
      "delivery_time": "2-5 hari kerja",
      "coverage": "Seluruh Indonesia",
      "packaging": "Kemasan aman dan rapi"
    }
  }
}